const newsList = {
  picNews: [
    {
      id: 1,
      title: '青海玛多发生5.8级地震',
      content: '据@中国地震台网速报 ，08月13日12时21分在青海果洛州玛多县（北纬34.58度，东经97.54度）发生5.8级地震，震源深度8千米。',
      time: '08-13 18:26',
      picList: ['../../../../../../../images/hotNews/青海地震.jpg', '../../../../../../../images/hotNews/青海地震2.jpg', '../../../../../../../images/hotNews/靖国神社新闻2.jpg'],
      from: ''
    },
    {
      id: 2,
      title: '无论在靖国神社前合影，还是到乃木神社参加婚礼，张哲瀚都触碰了历史伤痕，伤害了民族感情',
      content: '无论在靖国神社前合影，还是到乃木神社参加婚礼，张哲瀚都触碰了历史伤痕，伤害了民族感情，不能简单归咎为“曾经无知”。就在刚刚，有日本大臣到靖国神社“拜鬼”，中方坚决反对日本政要这种错误做法。身为中国人，应铭记历史，砥砺前行；绝不能是非不分，甚至误导青少年！请记住：靖国神社尽是鬼，勿忘历史当自强！',
      time: '08-13 14:53',
      picList: ['../../../../../../../images/hotNews/靖国神社新闻2.jpg', '../../../../../../../images/hotNews/青海地震2.jpg', '../../../../../../../images/hotNews/靖国神社新闻.jpg'],
      from: ''
    },
    {
      id: 3,
      title: '三孩配套政策落地，关于税收、住房、入学的30个细节来了',
      content: '三孩配套政策落地，关于税收、住房、入学的30个细节来了',
      time: '08-13 12:03',
      picList: [],
      from: '第一财经'
    }
  ],
  videoNews: [
    {
      id: 21,
      title: '实拍郑州极端暴雨：地铁乘客被困消防救援 街头拍到子弟兵出动',
      content: '实拍郑州极端暴雨：地铁乘客被困消防救援 街头拍到子弟兵出动',
      time: '08-13 12:23',
      picUrl: "../../../../../../../images/hotNews/靖国神社新闻2.jpg",
      from: ''
    },
    {
      id: 22,
      title: '实拍郑州极端暴雨：地铁乘客被困消防救援 街头拍到子弟兵出动',
      content: '实拍郑州极端暴雨：地铁乘客被困消防救援 街头拍到子弟兵出动',
      time: '08-13 12:23',
      picUrl: "../../../../../../../images/hotNews/靖国神社新闻.jpg",
      from: ''
    }
  ]
}

export const getNewsList = new Promise(resolve => {
  resolve(newsList)
})